set_device -family {PolarFire} -die {MPF300TS}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\APB3\APB3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ResetSycnc.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterAddressDecoder.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DependenceChecker.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\BitScan0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TransactionController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterControl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RoundRobinArb.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TargetMuxController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\AddressController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Revision.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DERR_Slave.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_FF_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_Ram_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RdFifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataMux.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RequestQual.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RDataController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\SlaveDataMuxController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RespController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\FifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WriteDataMux.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WDataController.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Axi4CrossBar.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHBL_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Read_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Write_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHB_SM.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrAHBtoAXI4Converter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Bin2Gray.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_grayCodeCounter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_rdCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_wrCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RAM_BLOCK.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_FIFO.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_CmdFifoWriteCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Hold_Reg_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Rd.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_preCalcCmdFifoWrCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvrd.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_CTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\byte2bit.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_readWidthConv.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Wr.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvwr.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_brespCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_writeWidthConv.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DownConverter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_AChannel.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_BChannel.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel_SlvRid_Arb.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcRChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_downsizing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_Hold_Reg.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_ReadDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_Wchan_WriteDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_upsizing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChannel.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcAChannel.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\UpConverter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrDataWidthConv.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegSliceFull.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegisterSlice.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MasterConvertor.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvDataWidthConverter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvRead.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvWrite.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtocolConv.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvAXI4ID.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlaveConvertor.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\CoreAxi4Interconnect.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\AXI4_Interconnect\AXI4_Interconnect.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\CCC_0\CCC_0_0\CCC_0_CCC_0_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\CCC_0\CCC_0.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREAHBLITE_0\COREAHBLITE_0_0\rtl\vlog\core\coreahblite.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREAHBLITE_0\COREAHBLITE_0.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREAHBTOAPB3_0\COREAHBTOAPB3_0.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREAXITOAHBL\3.5.100\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREAXITOAHBL_0\COREAXITOAHBL_0_0\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREAXITOAHBL_0\COREAXITOAHBL_0.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_ujtag_wrapper.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_bufd.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_uj_jtag.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\COREJTAGDebug_0\COREJTAGDebug_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\CoreGPIO_0\CoreGPIO_0_0\rtl\vlog\core\coregpio.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\CoreGPIO_0\CoreGPIO_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\CCC_0\DDR3_0_CCC_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_A_11_0\DDR3_0_DDRPHY_BLK_IOD_A_11_0_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_A_12\DDR3_0_DDRPHY_BLK_IOD_A_12_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_A_13\DDR3_0_DDRPHY_BLK_IOD_A_13_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_A_14\DDR3_0_DDRPHY_BLK_IOD_A_14_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_A_15\DDR3_0_DDRPHY_BLK_IOD_A_15_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_BA\DDR3_0_DDRPHY_BLK_IOD_BA_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_BCLK_TRAINING\DDR3_0_DDRPHY_BLK_IOD_BCLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_CAS_N\DDR3_0_DDRPHY_BLK_IOD_CAS_N_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_CKE\DDR3_0_DDRPHY_BLK_IOD_CKE_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_CS_N\DDR3_0_DDRPHY_BLK_IOD_CS_N_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_ODT\DDR3_0_DDRPHY_BLK_IOD_ODT_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_RAS_N\DDR3_0_DDRPHY_BLK_IOD_RAS_N_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_REF_CLK_TRAINING\DDR3_0_DDRPHY_BLK_IOD_REF_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_RESET_N\DDR3_0_DDRPHY_BLK_IOD_RESET_N_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\IOD_WE_N\DDR3_0_DDRPHY_BLK_IOD_WE_N_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANECTRL_ADDR_CMD_0\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANECTRL_ADDR_CMD_0\DDR3_0_DDRPHY_BLK_LANECTRL_ADDR_CMD_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_CTRL\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_CTRL\DDR3_0_DDRPHY_BLK_LANE_0_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_IOD_DM\DDR3_0_DDRPHY_BLK_LANE_0_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_IOD_DQSW_TRAINING\DDR3_0_DDRPHY_BLK_LANE_0_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_IOD_DQS\DDR3_0_DDRPHY_BLK_LANE_0_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_IOD_DQ\DDR3_0_DDRPHY_BLK_LANE_0_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_0_IOD_READ_TRAINING\DDR3_0_DDRPHY_BLK_LANE_0_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_CTRL\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_CTRL\DDR3_0_DDRPHY_BLK_LANE_1_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_IOD_DM\DDR3_0_DDRPHY_BLK_LANE_1_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_IOD_DQSW_TRAINING\DDR3_0_DDRPHY_BLK_LANE_1_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_IOD_DQS\DDR3_0_DDRPHY_BLK_LANE_1_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_IOD_DQ\DDR3_0_DDRPHY_BLK_LANE_1_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\LANE_1_IOD_READ_TRAINING\DDR3_0_DDRPHY_BLK_LANE_1_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\ddr_init_iterator.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\ram_simple_dp.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\FIFO_BLK.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\LANE_CTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\LANE_ALIGNMENT.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\APB_IF.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\DLL_MON.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\flag_generator.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\trn_bclksclk.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\trn_cmdaddr.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\trn_dqsw.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\TRN_CLK.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\ddr4_vref.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\DELAY_CTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\APB_IOG_CTRL_SM.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\IOG_IF.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\dq_align_dqs_optimization.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\gate_training.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\RDLVL_TRAIN.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\RDLVL_SMS.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\RDLVL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\TRN_COMPLETE.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\VREF_TR.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\WRLVL_BOT.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\WRLVL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\LEVELLING.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\PHY_SIG_MOD.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\write_callibrator.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\TIP_CTRL_BLK.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\register_bank.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\CoreDDR_TIP_INT.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\COREDDR_TIP\2.1.101\rtl\vlog\core\CoreDDR_TIP_SYN.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0_DDRPHY_BLK\DDR3_0_DDRPHY_BLK.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DLL_0\DDR3_0_DLL_0_PF_CCC.v}
 add_include_path  {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DDRCTRL_0}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DDRCTRL_0\CoreDDRMemCtrlr_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\SgCore\PF_DDR_CFG_INIT\1.0.100\cfg_init.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DDR3_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\INIT_Monitor\INIT_Monitor_0\INIT_Monitor_INIT_Monitor_0_PF_INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\INIT_Monitor\INIT_Monitor.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\PF_TPSRAM_AHB_AXI_0\LSRAM_PF_TPSRAM_AHB_AXI_0_PF_TPSRAM.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_MAINCTRL_ECC.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_MAINCTRL.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_SLVIF.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\LSRAM\LSRAM.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_gluebridge.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_28.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_29.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_30.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_32.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4buffer_buffer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_33.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4buffer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_48.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4deinterleaver.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4id_indexer_trim.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4id_indexer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_18.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_22.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4user_yanker_yank.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_axi4user_yanker.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_coreplex_local_interrupter_clint.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_capture_chain.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_capture_update_chain_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_capture_update_chain.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_jtag_bypass_chain.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_capture_update_chain_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_reg.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_reg_vec_w4_i15.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_jtag_state_machine.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_negative_edge_latch_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_negative_edge_latch.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_jtag_tap_controller.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_debug_transport_module_jtag.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_reg_vec_w1_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_reg_vec_w2_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_sync_crossing_source_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_xbar.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_synchronizer_shift_reg_w31_d3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_xing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlbuffer_memory_bus_master_tlbuffer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlxbar_memory_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_memory_bus_mem_buses_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlatomic_automata_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlbuffer_periphery_bus_slave_tlbuffer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlbuffer_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_repeater_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_repeater_3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlfragmenter_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlxbar_periphery_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_periphery_bus_pbus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_synchronizer_shift_reg_w1_d3_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_reset_catch_and_sync_d3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_amoalu.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_arbiter_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_arbiter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_data_arrays_0_ext.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_data_arrays_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_dcache_data_array.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tag_array_ext.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tag_array.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlb.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_dcache_dcache.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_data_arrays_0_0_ext.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_data_arrays_0_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tag_array_0_ext.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tag_array_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_icache_icache.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_shift_queue.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlb_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_frontend_frontend.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_hella_cache_arbiter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_sync_crossing_sink_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_synchronizer_shift_reg_w1_d3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_sync_crossing_sink.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_xbar_int_xbar.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_alu.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_breakpoint_unit.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_csrfile.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_rvcexpander.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_ibuf.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_mul_div.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_plusarg_reader.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_rocket.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_11.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_13.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_14.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_15.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_6.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlbuffer_system_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlxbar_tl_master_xbar.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_rocket_tile_tile.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlcache_cork_system_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlfifofixer_system_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_simple_lazy_module_system_bus_from_tiletile.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_4.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlbuffer_system_bus_slave_tlbuffer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlfifofixer_system_bus_pbus_tlfifofixer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlsplitter_system_bus_master_tlsplitter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_repeater.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlwidth_widget_system_bus_slave_tlwidth_widget.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_identity_module.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlxbar_system_bus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_system_bus_sbus.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_synchronizer_shift_reg_w1_d4_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync_3.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_synchronizer_shift_reg_w1_d1_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync_4.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync_5.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_synchronizer_shift_reg_w12_d1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_sink_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_synchronizer_shift_reg_w54_d1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_sink_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_valid_sync.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_source_2.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlasync_crossing_sink_dmi_xing.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tldebug_module_inner_dm_inner.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tldebug_module_inner_async_dm_inner.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_source_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_dmito_tl_dmi2tl.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_int_sync_crossing_source.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_synchronizer_shift_reg_w42_d1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_sink.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_queue_source.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlasync_crossing_source_dm_inner.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_async_reset_reg_vec_w32_i0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tldebug_module_outer_dm_outer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlxbar_dmi_xbar.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tldebug_module_outer_async_dm_outer.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tldebug_module_debug.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_55.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_56.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlerror_error.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlfilter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_level_gateway.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_10.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlplic_plic.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_16.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_17.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlto_axi4_converter.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_queue_54.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlto_axi4.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_repeater_4.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_tlwidth_widget.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi_rocket_system.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI_0\core\miv_rv32ima_l1_axi.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\MiV_AXI\MiV_AXI.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi_clockmux.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi_chanctrl.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi_fifo.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi_rf.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi_control.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\spi.v}
read_verilog -mode system_verilog -lib CORESPI_LIB {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\Actel\DirectCore\CORESPI\5.2.104\rtl\vlog\core\corespi.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\SPI_Controller\SPI_Controller.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\Clock_gen.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\Rx_async.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\Tx_async.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\fifo_256x8_54sxa.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\CoreUART.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb_0\rtl\vlog\core_obfuscated\CoreUARTapb.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\UART_apb\UART_apb.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\reset_syn_0\reset_syn_0_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\reset_syn_0\reset_syn_0.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\reset_syn_1\reset_syn_1_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\reset_syn_1\reset_syn_1.v}
read_verilog -mode system_verilog {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\top\top.v}
set_top_level {top}
read_sdc -component {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\AXI4_Interconnect\AXI4_Interconnect_0\AXI4_Interconnect.sdc}
read_sdc -component {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\CCC_0\CCC_0_0\CCC_0_CCC_0_0_PF_CCC.sdc}
read_sdc -component {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\CCC_0\DDR3_0_CCC_0_PF_CCC.sdc}
read_sdc -component {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DDR3_0.sdc}
read_sdc -component {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\component\work\DDR3_0\DLL_0\DDR3_0_DLL_0_PF_CCC.sdc}
derive_constraints
write_sdc {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\constraint\top_derived_constraints.sdc}
write_pdc {C:\Users\Mikey\Desktop\LiberoProjects\PF_Mi_V_Tut\constraint\fp\top_derived_constraints.pdc}
